In [1]:
import pandas as pd
import numpy as np

In [2]:
datas = pd.date_range('20210101',periods=12)
datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12'],
              dtype='datetime64[ns]', freq='D')

In [3]:
nomes = ['Gustavo', 'Joice', 'Xita']
nomes

['Gustavo', 'Joice', 'Xita']

In [4]:
np.random.choice(nomes)

'Joice'

In [5]:
np.random.rand()*100

73.94720461836411

In [6]:
nome = []
valor = []
for i in range(12):
    nome.append(np.random.choice(nomes))
    valor.append(np.round( np.random.rand()*100, decimals=2))

In [7]:
nome

['Gustavo',
 'Gustavo',
 'Xita',
 'Joice',
 'Joice',
 'Gustavo',
 'Joice',
 'Xita',
 'Gustavo',
 'Joice',
 'Joice',
 'Xita']

In [8]:
valor

[45.78,
 7.21,
 47.3,
 98.05,
 14.97,
 63.38,
 93.52,
 26.14,
 50.01,
 58.26,
 33.47,
 11.75]

In [9]:
df = pd.DataFrame({'dia': datas, 'cliente': nome, 'valor': valor})
df

          dia  cliente  valor
0  2021-01-01  Gustavo  45.78
1  2021-01-02  Gustavo   7.21
2  2021-01-03     Xita  47.30
3  2021-01-04    Joice  98.05
4  2021-01-05    Joice  14.97
5  2021-01-06  Gustavo  63.38
6  2021-01-07    Joice  93.52
7  2021-01-08     Xita  26.14
8  2021-01-09  Gustavo  50.01
9  2021-01-10    Joice  58.26
10 2021-01-11    Joice  33.47
11 2021-01-12     Xita  11.75

In [10]:
df.groupby('cliente').sum()

          valor
cliente
Gustavo  166.38
Joice    298.27
Xita      85.19

In [11]:
df.pivot(index='dia',columns='cliente',values='valor')

cliente     Gustavo  Joice   Xita
dia
2021-01-01    45.78    NaN    NaN
2021-01-02     7.21    NaN    NaN
2021-01-03      NaN    NaN  47.30
2021-01-04      NaN  98.05    NaN
2021-01-05      NaN  14.97    NaN
2021-01-06    63.38    NaN    NaN
2021-01-07      NaN  93.52    NaN
2021-01-08      NaN    NaN  26.14
2021-01-09    50.01    NaN    NaN
2021-01-10      NaN  58.26    NaN
2021-01-11      NaN  33.47    NaN
2021-01-12      NaN    NaN  11.75